<a href="https://colab.research.google.com/github/santhoshbvsrk/DeepLearning/blob/main/ChurnModelling/ChurnModelling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/santhoshbvsrk/DeepLearning/main/ChurnModelling/Churn_Modelling.csv")

In [3]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

Checking for Missing Values

In [5]:
df.isna().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

Replacing Index with RowNumber column as it can be considered as Index.

In [11]:
df=df.set_index('RowNumber')

In [12]:
df.head()

           CustomerId   Surname  ...  EstimatedSalary Exited
RowNumber                        ...
1            15634602  Hargrave  ...        101348.88      1
2            15647311      Hill  ...        112542.58      0
3            15619304      Onio  ...        113931.57      1
4            15701354      Boni  ...         93826.63      0
5            15737888  Mitchell  ...         79084.10      0

[5 rows x 13 columns]

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10000 non-null  int64
 1   Surname          10000 non-null  object
 2   CreditScore      10000 non-null  int64
 3   Geography        10000 non-null  object
 4   Gender           10000 non-null  object
 5   Age              10000 non-null  int64
 6   Tenure           10000 non-null  int64
 7   Balance          10000 non-null  float64
 8   NumOfProducts    10000 non-null  int64
 9   HasCrCard        10000 non-null  int64
 10  IsActiveMember   10000 non-null  int64
 11  EstimatedSalary  10000 non-null  float64
 12  Exited           10000 non-null  int64
dtypes: float64(2), int64(8), object(3)
memory usage: 1.1+ MB

In [26]:
df[['Surname','Geography','Gender','Age']].value_counts(ascending=False)

Surname   Geography  Gender  Age
Wright    Germany    Female  48     3
Genovesi  France     Female  33     3
Tien      France     Male    34     3
Chinedum  France     Male    34     3
Smith     France     Male    37     3
                                   ..
Nwebube   Spain      Male    37     1
                             34     1
          Germany    Male    44     1
          France     Male    37     1
Abazu     Spain      Female  28     1
Length: 9759, dtype: int64



1.   CustomerId is the only Unique Key in the dataset, as combination of other fields are returning more than 1 records. For example, there are multiple customers sharing the same surname, Geography, Gender & Age.
2.   Exited is our target variable which says if a customer has left the bank or not.
3. Of the 10k customers 2037 Customers have left bank i.e., 20.37% of customer have left bank.


**NOTE**: Here 1 means YES & 0 means NO

In [27]:
df[(df.Surname=='Wright') & (df.Geography=='Germany') & (df.Gender=='Female') & (df.Age==48)]

           CustomerId Surname  ...  EstimatedSalary Exited
RowNumber                      ...
4022         15697100  Wright  ...        184564.67      1
8911         15744873  Wright  ...        101314.65      1
9219         15806318  Wright  ...         15068.53      1

[3 rows x 13 columns]

In [43]:
df[df['Exited']==1]['CreditScore'].value_counts()

850    43
651    17
705    16
637    14
727    13
       ..
836     1
800     1
838     1
776     1
486     1
Name: CreditScore, Length: 420, dtype: int64

In [44]:
df[df['Exited']==0]['CreditScore'].value_counts()

850    190
678     50
655     43
684     43
670     42
      ...
419      1
441      1
442      1
414      1
408      1
Name: CreditScore, Length: 442, dtype: int64

In [30]:
df['Exited'].value_counts()

0    7963
1    2037
Name: Exited, dtype: int64

In [29]:
df['IsActiveMember'].value_counts()

1    5151
0    4849
Name: IsActiveMember, dtype: int64

In [28]:
df['HasCrCard'].value_counts()

1    7055
0    2945
Name: HasCrCard, dtype: int64